feaser/openblt/stm32c0_port/Target/Demo/TRICORE_TC2_TC275_Lite_Kit_ADS/Boot/Libraries/Infra/Sfr/TC27D/_Reg/IfxHsct_regdef.h
/** \brief  Access Enable Register 1 */
typedef struct _Ifx_HSCT_ACCEN1_Bits
{
    unsigned int reserved_0:32;             /**< \brief \internal Reserved */
} Ifx_HSCT_ACCEN1_Bits;

/** \brief  Clock Control Register */
typedef struct _Ifx_HSCT_CLC_Bits
{
    unsigned int DISR:1;                    /**< \brief [0:0] Module Disable Request Bit (rw) */
    unsigned int DISS:1;                    /**< \brief [1:1] Module Disable Status Bit (r) */
    unsigned int reserved_2:1;              /**< \brief \internal Reserved */
    unsigned int EDIS:1;                    /**< \brief [3:3] Sleep Mode Enable Control (rw) */
    unsigned int reserved_4:28;             /**< \brief \internal Reserved */
} Ifx_HSCT_CLC_Bits;

/** \brief  Configuration physical layer register */
typedef struct _Ifx_HSCT_CONFIGPHY_Bits
{
    unsigned int reserved_0:1;              /**< \brief \internal Reserved */
    unsigned int PLLPON:1;                  /**< \brief [1:1] PLL Power On (Master Mode only) (rw) */
    unsigned int PLLPE:6;                   /**< \brief [7:2] PLL phase enable - allows to enable/disable each of the 6 Phase outputs. (rw) */
    unsigned int PLLWMF:6;                  /**< \brief [13:8] PLL frequency control word multiplication factor (rw) */
    unsigned int PLLKPKI:1;                 /**< \brief [14:14] KP/KI Setting (rw) */
    unsigned int PHYRST:1;                  /**< \brief [15:15] Physical Layer Reset (rw) */
    unsigned int PLLKP:3;                   /**< \brief [18:16] KP of PLL - Configuration of PLL beta coefficients of proportional part of loop filter (rw) */
    unsigned int PLLKI:3;                   /**< \brief [21:19] KI of PLL - Configuration of PLL alpha coefficients of integral part of loop filter (rw) */
    unsigned int PLLIVR:4;                  /**< \brief [25:22] Adjustment for integrated voltage regulator (rw) */
    unsigned int reserved_26:2;             /**< \brief \internal Reserved */
    unsigned int OSCCLKEN:1;                /**< \brief [28:28] Enable Oscillator Clock as PLL reference clock (rw) */
    unsigned int reserved_29:3;             /**< \brief \internal Reserved */
} Ifx_HSCT_CONFIGPHY_Bits;

/** \brief  Clear To Send Control Register */
typedef struct _Ifx_HSCT_CTSCTRL_Bits
{
    unsigned int CTS_FRAME:1;               /**< \brief [0:0] Transmit CTS Frame Generation (rw) */
    unsigned int CTS_TXD:1;                 /**< \brief [1:1] Disable TX CTS signaling (rw) */
    unsigned int CTS_RXD:1;                 /**< \brief [2:2] Disable RX CTS detection (rw) */
    unsigned int HSSL_CTS_FBD:1;            /**< \brief [3:3] Disable HSSL interface CTS Frame Blocking (rw) */
    unsigned int reserved_4:28;             /**< \brief \internal Reserved */
} Ifx_HSCT_CTSCTRL_Bits;

/** \brief  Transmission Disable Register */
typedef struct _Ifx_HSCT_DISABLE_Bits
{
    unsigned int TX_DIS:1;                  /**< \brief [0:0] Disable HSCT Transmit path in Master interface (rw) */
    unsigned int RX_DIS:1;                  /**< \brief [1:1] Disable HSCT Receive path in Master interface (rw) */
    unsigned int RX_HEPD:1;                 /**< \brief [2:2] Disable RX Header Error Discard Payload data. (rw) */
    unsigned int reserved_3:29;             /**< \brief \internal Reserved */
} Ifx_HSCT_DISABLE_Bits;

/** \brief  Module Identification Register */
typedef struct _Ifx_HSCT_ID_Bits
{
    unsigned int MOD_REV:8;                 /**< \brief [7:0] Module Revision Number (r) */
    unsigned int MOD_TYPE:8;                /**< \brief [15:8] Module Type (r) */
    unsigned int MODNUMBER:16;              /**< \brief [31:16] Module Number Value (r) */
} Ifx_HSCT_ID_Bits;

/** \brief  CPU transfer control register */
typedef struct _Ifx_HSCT_IFCTRL_Bits
{
    unsigned int IFCVS:8;                   /**< \brief [7:0] Master Mode - Interface Control Value to be send to Slave interface (rw) */
    unsigned int SIFCV:1;                   /**< \brief [8:8] Master Mode - Slave IF control frame trigger (w) */
    unsigned int reserved_9:7;              /**< \brief \internal Reserved */
    unsigned int MRXSPEED:2;                /**< \brief [17:16] Master Mode RX speed (rw) */
    unsigned int MTXSPEED:2;                /**< \brief [19:18] Master Mode TX speed (rw) */
    unsigned int IFTESTMD:1;                /**< \brief [20:20] Master Mode Interface Test Mode (rw) */
    unsigned int reserved_21:11;            /**< \brief \internal Reserved */
} Ifx_HSCT_IFCTRL_Bits;

/** \brief  Interface Status Register */
typedef struct _Ifx_HSCT_IFSTAT_Bits
{
    unsigned int RX_STAT:3;                 /**< \brief [2:0] HSCT slave interface Status for RX link (rh) */
    unsigned int TX_STAT:2;                 /**< \brief [4:3] HSCT slave interface Status for TX link (rh) */
    unsigned int reserved_5:27;             /**< \brief \internal Reserved */
} Ifx_HSCT_IFSTAT_Bits;

/** \brief  Initialization register */
typedef struct _Ifx_HSCT_INIT_Bits
{
    unsigned int reserved_0:1;              /**< \brief \internal Reserved */
    unsigned int SYS_CLK_EN:1;              /**< \brief [1:1] Enable SysClk in Master interface (rw) */
    unsigned int SRCF:1;                    /**< \brief [2:2] Select SysClk / Reference Clock Frequency rate (rw) */
    unsigned int IFM:1;                     /**< \brief [3:3] Select Interface Mode (rw) */
    unsigned int reserved_4:6;              /**< \brief \internal Reserved */
    unsigned int LHLR:1;                    /**< \brief [10:10] Loopback path at Slave interface side at higher layer system RAM. (rw) */
    unsigned int reserved_11:5;             /**< \brief \internal Reserved */
    unsigned int TXHD:3;                    /**< \brief [18:16] Transmit High Speed Divider. (rw) */
    unsigned int RXHD:3;                    /**< \brief [21:19] Receive High Speed Divider. (rw) */
    unsigned int reserved_22:10;            /**< \brief \internal Reserved */
} Ifx_HSCT_INIT_Bits;

/** \brief  Interrupt register */
typedef struct _Ifx_HSCT_IRQ_Bits
{
    unsigned int reserved_0:1;              /**< \brief \internal Reserved */
    unsigned int HER:1;                     /**< \brief [1:1] Header error detected (rh) */
    unsigned int PYER:1;                    /**< \brief [2:2] Payload error detected (rh) */
    unsigned int CER:1;                     /**< \brief [3:3] HSCT command error (rh) */
    unsigned int IFCFS:1;                   /**< \brief [4:4] HSCT interface control frame send (rh) */
    unsigned int SMER:1;                    /**< \brief [5:5] Speed Mode Switch Error (Master Mode only) (rh) */
    unsigned int USMSF:1;                   /**< \brief [6:6] Unsolicited message frame send finished (rh) */
    unsigned int PLER:1;                    /**< \brief [7:7] PLL lost lock error (rh) */
    unsigned int USM:1;                     /**< \brief [8:8] Unsolicited Message Received (rh) */
    unsigned int PAR:1;                     /**< \brief [9:9] PING Answer Received (rh) */
    unsigned int TXTE:1;                    /**< \brief [10:10] TX transfer error occurred on a disabled TX channel. (rh) */
    unsigned int SFO:1;                     /**< \brief [11:11] Synchronization FIFO overflow (in RX direction) (rh) */
    unsigned int SFU:1;                     /**< \brief [12:12] Synchronization FIFO underflow (in TX direction) (rh) */
    unsigned int reserved_13:19;            /**< \brief \internal Reserved */
} Ifx_HSCT_IRQ_Bits;

/** \brief  Interrupt clear register */
typedef struct _Ifx_HSCT_IRQCLR_Bits
{
    unsigned int reserved_0:1;              /**< \brief \internal Reserved */
    unsigned int HERCLR:1;                  /**< \brief [1:1] Header error detected interrupt clear (w) */
    unsigned int PYERCLR:1;                 /**< \brief [2:2] Payload error detected interrupt clear (w) */
    unsigned int CERCLR:1;                  /**< \brief [3:3] HSCT command error interrupt clear (w) */
    unsigned int IFCFSCLR:1;                /**< \brief [4:4] HSCT interface control command send interrupt clear (w) */
    unsigned int SMERCLR:1;                 /**< \brief [5:5] Speed Mode Switch Error interrupt clear (w) */
    unsigned int USMSFCLR:1;                /**< \brief [6:6] Unsolicited message frame send finished interrupt clear (w) */
    unsigned int PLERCLR:1;                 /**< \brief [7:7] PLL lost lock error interrupt clear (w) */
    unsigned int USMCLR:1;                  /**< \brief [8:8] Unsolicited Message received clear (w) */
    unsigned int PARCLR:1;                  /**< \brief [9:9] PING Answer received clear (w) */
    unsigned int TXTECLR:1;                 /**< \brief [10:10] TX disable error interrupt clear (w) */
    unsigned int SFOCLR:1;                  /**< \brief [11:11] Synchronization FIFO overflow (in RX direction) interrupt clear (w) */
    unsigned int SFUCLR:1;                  /**< \brief [12:12] Synchronization FIFO underflow (in TX direction) interrupt clear (w) */
    unsigned int reserved_13:19;            /**< \brief \internal Reserved */
} Ifx_HSCT_IRQCLR_Bits;

/** \brief  Interrupt enable register */
typedef struct _Ifx_HSCT_IRQEN_Bits
{
    unsigned int reserved_0:1;              /**< \brief \internal Reserved */
    unsigned int HEREN:1;                   /**< \brief [1:1] Header error detected interrupt enable (rw) */
    unsigned int PYEREN:1;                  /**< \brief [2:2] Payload error detected interrupt enable (rw) */
    unsigned int CEREN:1;                   /**< \brief [3:3] HSCT command error interrupt enable (rw) */
    unsigned int IFCFSEN:1;                 /**< \brief [4:4] HSCT interface control command send enable (rw) */
    unsigned int SMEREN:1;                  /**< \brief [5:5] Speed Mode Switch Error interrupt enable (rw) */
    unsigned int USMSFEN:1;                 /**< \brief [6:6] Unsolicited message frame send finished (rw) */
    unsigned int PLEREN:1;                  /**< \brief [7:7] PLL lost lock error interrupt enable (rw) */
    unsigned int USMEN:1;                   /**< \brief [8:8] Unsolicited Message received enable (rw) */
    unsigned int PAREN:1;                   /**< \brief [9:9] PING Answer Received enable (rw) */
    unsigned int TXTEEN:1;                  /**< \brief [10:10] TX disable error interrupt enable (rw) */
    unsigned int SFOEN:1;                   /**< \brief [11:11] Synchronization FIFO overflow (in RX direction) interrupt enable (rw) */
    unsigned int SFUEN:1;                   /**< \brief [12:12] Synchronization FIFO underflow (in TX direction) interrupt enable (rw) */
    unsigned int reserved_13:19;            /**< \brief \internal Reserved */
} Ifx_HSCT_IRQEN_Bits;

