feaser/openblt/stm32c0_port/Target/Demo/TRICORE_TC2_TC275_Lite_Kit_ADS/Boot/Libraries/Infra/Sfr/TC27D/_Reg/IfxHsct_regdef.h
/** \brief  Reset Register 0 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_HSCT_KRST0_Bits B;                  /**< \brief Bitfield access */
} Ifx_HSCT_KRST0;

/** \brief  Reset Register 1 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_HSCT_KRST1_Bits B;                  /**< \brief Bitfield access */
} Ifx_HSCT_KRST1;

/** \brief  Reset Status Clear Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_HSCT_KRSTCLR_Bits B;                /**< \brief Bitfield access */
} Ifx_HSCT_KRSTCLR;

/** \brief  OCDS Control and Status */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_HSCT_OCS_Bits B;                    /**< \brief Bitfield access */
} Ifx_HSCT_OCS;

/** \brief  Sleep Control Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_HSCT_SLEEPCTRL_Bits B;              /**< \brief Bitfield access */
} Ifx_HSCT_SLEEPCTRL;

/** \brief  Status Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_HSCT_STAT_Bits B;                   /**< \brief Bitfield access */
} Ifx_HSCT_STAT;

/** \brief  STATPHY */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_HSCT_STATPHY_Bits B;                /**< \brief Bitfield access */
} Ifx_HSCT_STATPHY;

/** \brief  Unsolicited Status Message Received */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_HSCT_USMR_Bits B;                   /**< \brief Bitfield access */
} Ifx_HSCT_USMR;

/** \brief  Unsolicited Status Message Send */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_HSCT_USMS_Bits B;                   /**< \brief Bitfield access */
} Ifx_HSCT_USMS;
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Hsct_struct
 * \{  */
/******************************************************************************/
/** \name Object L0
 * \{  */

/** \brief  HSCT object */
typedef volatile struct _Ifx_HSCT
{
    Ifx_HSCT_CLC CLC;                       /**< \brief 0, Clock Control Register */
    unsigned char reserved_4[4];            /**< \brief 4, \internal Reserved */
    Ifx_HSCT_ID ID;                         /**< \brief 8, Module Identification Register */
    unsigned char reserved_C[4];            /**< \brief C, \internal Reserved */
    Ifx_HSCT_INIT INIT;                     /**< \brief 10, Initialization register */
    Ifx_HSCT_IFCTRL IFCTRL;                 /**< \brief 14, CPU transfer control register */
    Ifx_HSCT_SLEEPCTRL SLEEPCTRL;           /**< \brief 18, Sleep Control Register */
    Ifx_HSCT_CTSCTRL CTSCTRL;               /**< \brief 1C, Clear To Send Control Register */
    Ifx_HSCT_DISABLE DISABLE;               /**< \brief 20, Transmission Disable Register */
    Ifx_HSCT_STAT STAT;                     /**< \brief 24, Status Register */
    Ifx_HSCT_IFSTAT IFSTAT;                 /**< \brief 28, Interface Status Register */
    unsigned char reserved_2C[4];           /**< \brief 2C, \internal Reserved */
    Ifx_HSCT_CONFIGPHY CONFIGPHY;           /**< \brief 30, Configuration physical layer register */
    Ifx_HSCT_STATPHY STATPHY;               /**< \brief 34, STATPHY */
    unsigned char reserved_38[8];           /**< \brief 38, \internal Reserved */
    Ifx_HSCT_IRQ IRQ;                       /**< \brief 40, Interrupt register */
    Ifx_HSCT_IRQEN IRQEN;                   /**< \brief 44, Interrupt enable register */
    Ifx_HSCT_IRQCLR IRQCLR;                 /**< \brief 48, Interrupt clear register */
    unsigned char reserved_4C[4];           /**< \brief 4C, \internal Reserved */
    Ifx_HSCT_USMR USMR;                     /**< \brief 50, Unsolicited Status Message Received */
    Ifx_HSCT_USMS USMS;                     /**< \brief 54, Unsolicited Status Message Send */
    unsigned char reserved_58[65424];       /**< \brief 58, \internal Reserved */
    Ifx_HSCT_OCS OCS;                       /**< \brief FFE8, OCDS Control and Status */
    Ifx_HSCT_KRSTCLR KRSTCLR;               /**< \brief FFEC, Reset Status Clear Register */
    Ifx_HSCT_KRST1 KRST1;                   /**< \brief FFF0, Reset Register 1 */
    Ifx_HSCT_KRST0 KRST0;                   /**< \brief FFF4, Reset Register 0 */
    Ifx_HSCT_ACCEN1 ACCEN1;                 /**< \brief FFF8, Access Enable Register 1 */
    Ifx_HSCT_ACCEN0 ACCEN0;                 /**< \brief FFFC, Access Enable Register 0 */
} Ifx_HSCT;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXHSCT_REGDEF_H */
